app/Product.php

select `image_1`, `image_2`, `image_3`, `id` from `products` where `products`.`id` = '1' limit 1
---
    public function update_product($data,$id)
    {
        $product_data = $data;
        $image_1 = $data['old_image_1'];
        $image_2 = $data['old_image_2'];
        $image_3 = $data['old_image_3'];
        $data['old_image_1'] = 0;
        $data['old_image_2'] = 0;
        $data['old_image_3'] = 0;
        $imageValue = Product::select('image_1','image_2','image_3','id')->find($id);

update `products` set `title` = 'sdasas', `description` = 'asd', `tags` = 'asd', `wrap_count_A` = '2', `wrap_count_B` = '2', `wrap_count_C` = '2', `weft_count_A` = '1', `weft_count_B` = '1', `weft_count_C` = '1', `reed` = '25', `pick` = '2', `width_inch` = '2', `width_cm` = '2', `weave` = '4', `category` = '6', `sub_category` = '6', `gsm` = '2', `trade_name` = '3', `finish` = '2', `old_image_1` = 0, `old_image_2` = 0, `old_image_3` = 0, `color_1` = '3', `blend_1` = '2', `percentage_1` = '100', `percentage_2` = '', `percentage_3` = '', `percentage_4` = '', `meter` = '2', `yard` = '2', `moq` = '2', `certificate` = '1', `insception` = '1', `test` = '1', `location` = '1', `country` = '1', `created_by` = 1 where `id` = '1'
---
        unset($data['quantity'],$data['price'],$data['price_id']);
        try{
            $data['slug_title'] = Str::slug($data['title'], '-');
            $product = DB::table('products')->where('id',$id)->update($data);

update `product_quantity_prices` set `price` = '19', `product_quantity_prices`.`updated_at` = '2020-09-16 06:04:09' where `product_id` = '1'
---
            {
                $id = $product_data['price_id'][$key];
                $price = $product_data['price'][$key];
                ProductQuantityPrice::where('id',$id)->update(['price'=>$price]);

update `products` set `image_1` = '5f61e39d21a68Develop.png' where `id` = 9
update `products` set `image_2` = '5f61e39d23a25s.jpg' where `id` = 9
---
    public function uploadPic($image_1,$image_2,$image_3,$id)
    {
        // Uploading image and making folder
        if(!is_string($image_1))
        {
            $product_image_1 = uniqid().$image_1->getClientOriginalName();
            $destination_path = public_path("images/product/".$id);
            $image_1->move($destination_path,$product_image_1);
            DB::table('products')->where('id',$id)->update(['image_1'=>$product_image_1]);
        }
        else
        {
            DB::table('products')->where('id',$id)->update(['image_1'=>$image_1]);
        }

        // Uploading image and making folder
        if(!is_string($image_2))
        {
        $product_image_2 = uniqid().$image_2->getClientOriginalName();
        $destination_path = public_path("images/product/".$id);
        $image_2->move($destination_path,$product_image_2);
        DB::table('products')->where('id',$id)->update(['image_2'=>$product_image_2]);

update `products` set `image_3` = '5f61e39d25085Develop.png' where `id` = 9
---
            $product_image_3 = uniqid().$image_3->getClientOriginalName();
            $destination_path = public_path("images/product/".$id);
            $image_3->move($destination_path,$product_image_3);
            DB::table('products')->where('id',$id)->update(['image_3'=>$product_image_3]);