app/Http/Controllers/AdminController.php

select count(*) as aggregate from `products` where `is_active` = 1
select count(*) as aggregate from `users` where `user_type` = '2'
---
    public function adminIndex()
    {
        $category = Category::count();
        $subcategory = SubCategory::count();
        $subcategory = SubCategory::count();
        $blendContent = BlendContent::count();
        $color = Color::count();
        $country = Country::count();
        $finish = Finish::count();
        $tradeName = TradeName::count();
        $price = Price::count();
        $weave = Weave::count();
        $certificate = Certificate::count();
        $product = Product::where('is_active',1)->count();
        $seller = User::where('user_type','=','2')->count();