app/Http/Controllers/HomeController.php

select `id`, `name`, `phonecode` from `countries`
---
   public function seller_register()
   {
       $type = '2';
       $countries = Country::select('id','name','phonecode')->get();

select `name`, `id` from `states` where `country_id` = '2'
select `phonecode` from `countries` where `id` = '2' limit 1
---
    public function findState()
    {
        $country = request()->val;
        $states = States::select('name','id')->where('country_id',$country)->get();
        $country = Country::select('phonecode')->where('id',$country)->first();

select `phonecode` from `countries` where `id` = '1' limit 1
---
    public function findPhoneCode()
    {
        $country = request()->val;
        $countries = Country::select('phonecode')->where('id',$country)->first();

select `name`, `id` from `cities` where `state_id` = '53'
---
    public function findCity()
    {
        $country = request()->val;
        $cities = City::select('name','id')->where('state_id',$country)->get();