app/Http/Controllers/ProductController.php

    public function create()
    {
        $data = new Product();
        $product_price = new ProductQuantityPrice();
        $weaves = Weave::select('id','weave_name')->where('is_active',1)->get();
        $finishes = Finish::select('id','finish_name')->where('is_active',1)->get();
        $tadeNames = TradeName::select('id','trade_name')->where('is_active',1)->get();
        $categories = Category::select('id','category_name')->where('is_active',1)->get();
        $blendContents = BlendContent::select('id','blend_content_name')->where('is_active',1)->get();
        $colors = Color::select('id','color_name')->where('is_active',1)->get();
        $certificaties = Certificate::select('id','certificate_name')->where('is_active',1)->get();
        $WeftCounts = WeftCount::select('id','weft_count')->where('is_active',1)->get();
        $WrapCounts = WrapCount::select('id','wrap_count')->where('is_active',1)->get();
        $countries = Country::select('id','name')->get();
        $quantities = Quantity::select('quantity','id')->get();
        $SellerCountry = Seller::select('country','currency')->where('user_id',Auth::user()->id)->first();
---
select `id`, `weave_name` from `weaves` where `is_active` = 1
select `id`, `finish_name` from `finishes` where `is_active` = 1
select `id`, `trade_name` from `trade_names` where `is_active` = 1
select `id`, `category_name` from `categories` where `is_active` = 1
select `id`, `blend_content_name` from `blend_contents` where `is_active` = 1
select `id`, `color_name` from `colors` where `is_active` = 1
select `id`, `certificate_name` from `certificates` where `is_active` = 1
select `id`, `weft_count` from `weft_counts` where `is_active` = 1
select `id`, `wrap_count` from `wrap_counts` where `is_active` = 1
select `id`, `name` from `countries`
select `quantity`, `id` from `quantities`
select `country`, `currency` from `sellers` where `user_id` = 1 limit 1

    public function edit($id)
    {
        $data = Product::find($id);
        $product_price = ProductQuantityPrice::where('product_id',$id)->select('id','price')->get();
        $weaves = Weave::select('id','weave_name')->where('is_active',1)->get();
        $finishes = Finish::select('id','finish_name')->where('is_active',1)->get();
        $tadeNames = TradeName::select('id','trade_name')->where('is_active',1)->get();
        $categories = Category::select('id','category_name')->where('is_active',1)->get();
        $blendContents = BlendContent::select('id','blend_content_name')->where('is_active',1)->get();
        $colors = Color::select('id','color_name')->where('is_active',1)->get();
        $certificaties = Certificate::select('id','certificate_name')->where('is_active',1)->get();
        $WeftCounts = WeftCount::select('id','weft_count')->where('is_active',1)->get();
        $WrapCounts = WrapCount::select('id','wrap_count')->where('is_active',1)->get();
        $countries = Country::select('id','name')->get();
        $quantities = Quantity::select('quantity','id')->get();
        $SellerCountry = Seller::select('country')->where('user_id',Auth::user()->id)->first();
---
select `id`, `price` from `product_quantity_prices` where `product_id` = '1'
select `id`, `weave_name` from `weaves` where `is_active` = 1
select `id`, `finish_name` from `finishes` where `is_active` = 1
select `id`, `trade_name` from `trade_names` where `is_active` = 1
select `id`, `category_name` from `categories` where `is_active` = 1
select `id`, `blend_content_name` from `blend_contents` where `is_active` = 1
select `id`, `color_name` from `colors` where `is_active` = 1
select `id`, `certificate_name` from `certificates` where `is_active` = 1
select `id`, `weft_count` from `weft_counts` where `is_active` = 1
select `id`, `wrap_count` from `wrap_counts` where `is_active` = 1
select `id`, `name` from `countries`
select `quantity`, `id` from `quantities`
select `country` from `sellers` where `user_id` = 1 limit 1

    public function destroy($id)
    {
        try{
            $data = Product::find($id);
            $data->delete();
            ProductQuantityPrice::where('product_id',$id)->delete();
---
delete from `products` where `id` = 1
delete from `product_quantity_prices` where `product_id` = '1'