app/Http/Controllers/SellerController.php

    public function dashboard()
    {
        $product = Product::where('is_active',1)->where('created_by',Auth::user()->id)->count();
        $seller  = Seller::select('user_id','logo')->where('user_id',Auth::user()->id)->first();
---
select count(*) as aggregate from `products` where `is_active` = 1 and `created_by` = 1
select `user_id`, `logo` from `sellers` where `user_id` = 1 limit 1

    public function seller_data($id)
    {
        $data = User::select('users.id as user_id','f_name','l_name','email','contact','address','city','state','country','zip','company_name','pan_number','gst_number','logo','is_active','countries.name as countryname','states.name as statename','cities.name as cityname')
            ->join('sellers', 'users.id', '=', 'sellers.user_id')
                ->join('countries','sellers.country','=','countries.id')
                    ->join('states','sellers.state','=','states.id')
                        ->join('cities','sellers.city','=','cities.id')
                             ->where('users.id',$id)->first();
---
select `users`.`id` as `user_id`, `f_name`, `l_name`, `email`, `contact`, `address`, `city`, `state`, `country`, `zip`, `company_name`, `pan_number`, `gst_number`, `logo`, `is_active`, `countries`.`name` as `countryname`, `states`.`name` as `statename`, `cities`.`name` as `cityname` from `users` inner join `sellers` on `users`.`id` = `sellers`.`user_id` inner join `countries` on `sellers`.`country` = `countries`.`id` inner join `states` on `sellers`.`state` = `states`.`id` inner join `cities` on `sellers`.`city` = `cities`.`id` where `users`.`id` = '1' limit 1

    public function update_seller($id)
    {
        $value = request()->value;
        $reason = request()->reason;
        $type = "success";
        $message = "Seller Approved Successfully";
        try{
            DB::table('users')->where('id',$id)->update(['is_active'=>$value]);
            $user = User::select('display_name','email')->where('id',$id)->first();
---
update `users` set `is_active` = '1' where `id` = '35'
select `display_name`, `email` from `users` where `id` = '35' limit 1

    public function profile()
    {
        $id = Auth::user()->id;
        $countries = Country::select('id','name')->get();
        $cities = City::select('id','name')->get();
        $states = States::select('id','name')->get();
        $data = User::select('users.id as user_id','f_name','l_name','email','contact','address','city','state','country','zip','company_name','pan_number','gst_number','logo','is_active','countries.name as countryname','states.name as statename','cities.name as cityname')
            ->join('sellers', 'users.id', '=', 'sellers.user_id')
                ->join('countries','sellers.country','=','countries.id')
                    ->join('states','sellers.state','=','states.id')
                        ->join('cities','sellers.city','=','cities.id')
                             ->where('users.id',$id)->first();
---
select `id`, `name` from `countries`
select `id`, `name` from `cities`
select `id`, `name` from `states`
select `users`.`id` as `user_id`, `f_name`, `l_name`, `email`, `contact`, `address`, `city`, `state`, `country`, `zip`, `company_name`, `pan_number`, `gst_number`, `logo`, `is_active`, `countries`.`name` as `countryname`, `states`.`name` as `statename`, `cities`.`name` as `cityname` from `users` inner join `sellers` on `users`.`id` = `sellers`.`user_id` inner join `countries` on `sellers`.`country` = `countries`.`id` inner join `states` on `sellers`.`state` = `states`.`id` inner join `cities` on `sellers`.`city` = `cities`.`id` where `users`.`id` = 1 limit 1

    public function findSubcategory()
    {
        $val = request()->category_id;
        $sub_category = SubCategory::select('sub_category_name','id')->where('id',$val)->get();
---
select `sub_category_name`, `id` from `sub_categories` where `id` = '7'

    public function update_password($id)
    {
        $id = base64_decode($id);
        $password = User::select('password')->where('id',$id)->first();
        $old_password = request()->old_password;
        if(Hash::check($old_password,$password->password))
        {
            $new_password = Hash::make(request()->new_password);
            try
            {
                User::where('id',$id)->update(['password'=>$new_password]);
---
select `password` from `users` where `id` = '1' limit 1
update `users` set `password` = 'yCXVgX0Ec5VozdZnA52/2unhJmLQCRyACdWvTjgEqUsD0Bs1oeh.S', `users`.`updated_at` = '2020-09-16 08:13:14' where `id` = '1'